In [2]:
### Import Modul
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.2.4
1.20.1

### Persiapan Data Frame

In [3]:
n_rows=5
n_cols=5
cols=tuple('ABCDE')

df= pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),columns=cols)
                    
df

   A  B  C  D  E
0  2  8  4  4  7
1  8  5  4  8  1
2  7  1  5  9  4
3  3  5  3  5  7
4  7  5  7  2  2

### Mengganti label pada sebuah Kolom

In [5]:
df.rename(columns={'C':'Hobi'})
#Memakai Fungsi Rename

   A  B  Hobi  D  E
0  2  8     4  4  7
1  8  5     4  8  1
2  7  1     5  9  4
3  3  5     3  5  7
4  7  5     7  2  2

In [6]:
###Mengganti nama untuk banyak Kolom

df.rename(columns={'C':'Hobi','B':'Test'})

   A  Test  Hobi  D  E
0  2     8     4  4  7
1  8     5     4  8  1
2  7     1     5  9  4
3  3     5     3  5  7
4  7     5     7  2  2